// server/src/data/sinsal/12sinsal.map.ts

export const SINSAL_12_MAP: { [key: string]: { [key: string]: string } } = {
  寅午戌: {
    寅: "지살",
    卯: "년살",
    辰: "월살",
    巳: "망신",
    午: "장성",
    未: "반안",
    申: "역마",
    酉: "육해",
    戌: "화개",
    亥: "겁살",
    子: "재살",
    丑: "천살",
  },
  巳酉丑: {
    巳: "지살",
    午: "년살",
    未: "월살",
    申: "망신",
    酉: "장성",
    戌: "반안",
    亥: "역마",
    子: "육해",
    丑: "화개",
    寅: "겁살",
    卯: "재살",
    辰: "천살",
  },
  申子辰: {
    申: "지살",
    酉: "년살",
    戌: "월살",
    亥: "망신",
    子: "장성",
    丑: "반안",
    寅: "역마",
    卯: "육해",
    辰: "화개",
    巳: "겁살",
    午: "재살",
    未: "천살",
  },
  亥卯未: {
    亥: "지살",
    子: "년살",
    丑: "월살",
    寅: "망신",
    卯: "장성",
    辰: "반안",
    巳: "역마",
    午: "육해",
    未: "화개",
    申: "겁살",
    酉: "재살",
    戌: "천살",
  },
};

export const getSamhapGroup = (ji: string) => {
  if (["寅", "午", "戌"].includes(ji)) return "寅午戌";
  if (["巳", "酉", "丑"].includes(ji)) return "巳酉丑";
  if (["申", "子", "辰"].includes(ji)) return "申子辰";
  if (["亥", "卯", "未"].includes(ji)) return "亥卯未";
  return null;
};
